import { Container } from "react-bootstrap";

export default function PrivacyPolicy() {
  return (
    <Container>
      <h3>Политика конфиденциальности</h3>

      <p>
        В "Books" мы стремимся защищать конфиденциальность и интеллектуальную
        собственность наших пользователей. В этой политике конфиденциальности
        объясняется, как мы собираем, используем и передаем информацию о наших
        пользователях, а также условия использования нашей платформы.
      </p>

      <h3>Контент, создаваемый пользователями</h3>

      <p>
        Отправляя свои литературные произведения (включая, помимо прочего,
        рассказы, стихи, статьи и другой письменный контент) на нашу платформу,
        вы предоставляете нам неисключительную, действующую по всему миру,
        безвозмездную лицензию на публикацию, отображение и распространение
        вашей работы на нашей платформе. наш сайт и каналы в социальных сетях.
        Вы также признаете, что ваша работа может копироваться, распространяться
        и использоваться другими, и отказываетесь от любых претензий о нарушении
        авторских прав или прав интеллектуальной собственности против нас или
        любых сторонних пользователей нашей платформы.
      </p>

      <h3>Сбор личной информации</h3>

      <p>
        Когда вы создаете учетную запись на нашей платформе, мы собираем
        определенную личную информацию, в том числе:
      </p>
      <ul>
        <li>Ваше имя и адрес электронной почты</li>
        <li>Ваше имя пользователя и пароль</li>
        <li>
          Ваше литературное произведение и любые связанные с ним метаданные
          (например, название, теги)
        </li>
      </ul>

      <p>Мы используем эту информацию, чтобы вы могли:</p>

      <ul>
        <li>Создать и управлять своей учетной записью</li>
        <li>
          Публиковать и демонстрировать свои литературные произведения на нашей
          платформе.
        </li>
      </ul>

      <h3>Использование файлов cookie</h3>
      <p>
        Мы используем файлы cookie для отслеживания поведения и предпочтений
        пользователей на нашей платформе. Файлы cookie — это небольшие текстовые
        файлы, которые сохраняются на вашем устройстве, когда вы посещаете наш
        веб-сайт. Вы можете отключить файлы cookie в настройках вашего браузера,
        но это может повлиять на вашу возможность использовать определенные
        функции нашей платформы.
      </p>

      <h3>Безопасность</h3>

      <p>
        Мы принимаем разумные меры для защиты вашей личной информации и
        литературных произведений от несанкционированного доступа, раскрытия или
        использования. Однако никакие меры безопасности не являются надежными, и
        мы не можем гарантировать абсолютную безопасность вашей информации.
      </p>

      <h3>Изменения в настоящей Политике</h3>
      <p>
        Мы можем время от времени обновлять данную политику конфиденциальности.
        Если мы внесем существенные изменения, мы уведомим вас по электронной
        почте или через уведомление на нашей платформе.
      </p>
      <h3>Согласие</h3>
      <p>
        Используя нашу платформу, вы соглашаетесь на сбор, использование и обмен
        вашей личной информацией и литературными произведениями, как описано в
        настоящей политике конфиденциальности. Вы также подтверждаете, что
        прочитали и поняли наши условия обслуживания и правила сообщества.
      </p>
      <h3>Связаться с нами</h3>
      <p>
        Если у вас есть какие-либо вопросы или сомнения по поводу настоящей
        политики конфиденциальности, свяжитесь с нами по адресу
        savenkodasa772@gmail.com.
      </p>
      <p>
        Используя нашу платформу, вы соглашаетесь соблюдать условия настоящей
        политики конфиденциальности. Если вы не согласны с этими условиями,
        пожалуйста, не используйте нашу платформу.
      </p>
      <p>
        Обратите внимание, что это всего лишь пример политики, и вам следует
        адаптировать ее в соответствии со своими конкретными потребностями и
        действующими законами и правилами. Также рекомендуется попросить юриста
        просмотреть вашу политику, прежде чем публиковать ее на вашем веб-сайте.
      </p>
    </Container>
  );
}
